nguyenvietanh-abc/Kalman-Filter-Application-on-Gyroscope/sdkconfig.defaults
# --- Muc tieu ---
CONFIG_IDF_TARGET="esp32"

# --- BAT BUOC: tick 1000 Hz ---
# Mac dinh cua ESP-IDF la 100 Hz, tuc do phan giai cua xTaskDelayUntil chi la
# 10 ms. Vong lay mau 200 Hz can chu ky 5 ms; voi tick 100 Hz thi pdMS_TO_TICKS(5)
# lam tron xuong 0 tick va vong quay tu do, khong con dinh ky. Loi nay KHONG bao
# loi bien dich va rat kho phat hien tu ben ngoai.
CONFIG_FREERTOS_HZ=1000

# --- Console ---
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# --- Toi uu ---
# -O2: bo loc chay 200 Hz, moi buoc co vai chuc phep nhan float. Du thoai mai
# tren ESP32 240 MHz nhung khong co ly do de chay cham hon can thiet.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Cho phep dung phep float trong ngat neu ve sau chuyen sang doc theo ngat
# Data-Ready thay vi polling.
CONFIG_FREERTOS_FPU_IN_ISR=y

# --- Log ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- Stack cua task main ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
